In [3]:
import mysql.connector
import pandas as pd

In [5]:
connection=mysql.connector.connect(host="localhost",
                                  user="root",
                                  passwd="avinash270498nair")

cursorObject = connection.cursor()

connection.close()

In [7]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="avinash270498nair")

cursorObject = connection.cursor()

cursorObject.execute("create database e_commerce")

connection.close()

In [9]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="avinash270498nair",
                                     database = 'e_commerce')
 
cursorObject = connection.cursor()

In [13]:
supplier_table_query = """create table supplier( SUPP_ID int primary key , SUPP_NAME varchar(50),SUPP_CITY varchar(50), SUPP_Phone_NO varchar(10));"""
cursorObject.execute(supplier_table_query)

In [15]:
customer_table_query = """create table customer(CUS_ID INT NOT NULL,CUS_NAME VARCHAR (20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10),CUS_CITY VARCHAR(30),CUS_GENDER CHAR,PRIMARY KEY(CUS_ID));"""
cursorObject.execute(customer_table_query)

In [17]:
category_table_query = """create table category(CAT_Id INT NOT NULL,CAT_NAME VARCHAR(20) NULL DEFAULT NULL, PRIMARY KEY(CAT_ID));"""
cursorObject.execute(category_table_query)

In [21]:
product_table_query = """create table product(PRO_ID INT NOT NULL,PRO_NAME VARCHAR(20) NULL DEFAULT NULL,PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY(PRO_ID) ,FOREIGN KEY(CAT_ID) REFERENCES CATEGORY(CAT_ID));"""
cursorObject.execute(product_table_query)

In [25]:
product_details_table_query = """create table product_details(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL,SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,PRIMARY KEY(PROD_ID),FOREIGN KEY(PRO_ID) REFERENCES PRODUCT(PRO_ID), FOREIGN KEY(SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));"""
cursorObject.execute(product_details_table_query)

In [69]:
orders_table_query = """create table orders(ORD_ID INT NOT NULL,ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL, PRIMARY KEY(ORD_ID),FOREIGN KEY(CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY(PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));"""
cursorObject.execute(orders_table_query)

In [37]:
rating_table_query = """create table rating(RAT_ID INT NOT NULL,CUS_ID INT NOT NULL,SUPP_ID INT NOT NULL,RAT_RATSTARS INT NOT NULL,PRIMARY KEY(RAT_ID),FOREIGN KEY(SUPP_ID) REFERENCES SUPPLIER(SUPP_ID),FOREIGN KEY(CUS_ID) REFERENCES CUSTOMER(CUS_ID));"""
cursorObject.execute(rating_table_query)

In [39]:
connection.close()

connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="avinash270498nair",
                                     database='e_commerce')

cursorObject = connection.cursor()

In [41]:
insert_supplier_details = """INSERT INTO supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE_No)
                             VALUES (%s, %s, %s, %s)"""
val = [(1,"Rajesh Retails","Delhi",'1234567890'),
       (2,"Appario Ltd.","Mumbai",'2589631470'),
       (3,"Knome products","Banglore",'9785462315'),
       (4,"Bansal Retails","Kochi",'8975463285'),
       (5,"Mittal Ltd.","Lucknow",'7898456532')]
cursorObject.executemany(insert_supplier_details, val)
connection.commit()

In [43]:
insert_customer="""INSERT INTO CUSTOMER(CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER)
                   VALUES (%s,%s, %s, %s, %s)"""
val=[(1,"Aakash",9999999999,"Delhi","M"),
    (2,"Aman",9785463215,"Noida","M"),
    (3,"Neha",9999999998,"Mumbai","F"),
    (4,"Megha",9994562399,"Kolkatta","F"),
    (5,"Pulkit",7895999999,"Lucknow","M")]
cursorObject.executemany(insert_customer, val)
connection.commit()

In [45]:
insert_into_category="""INSERT INTO CATEGORY(CAT_Id,CAT_NAME)
                        VALUES(%s,%s)"""
val=[(1,"Books"),
    (2,"Games"),
    (3,"Groceries"),
    (4,"Electronics"),
    (5,"Clothes")]
cursorObject.executemany(insert_into_category, val)
connection.commit()

In [81]:
insert_into_product="""INSERT INTO PRODUCT(PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES(%s,%s,%s,%s)"""
val=[(1,"GTA V", "DFJDJFDJFDJFDJFJF", 2),
    (2,"T SHIRT", "DFDFJDFJDKFD", 5),
    (3,"ROG LAPTOP", "DFNTTNTNTERND", 4),
    (4,"OATS", "REURENTBTOTH", 3),
    (5,"HARRY POTTER", "NBEMCTHTJTH", 1)]
cursorObject.executemany(insert_into_product, val)
connection.commit()

In [83]:
insert_into_product_details="""INSERT INTO PRODUCT_DETAILS(PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE)
                        VALUES(%s,%s,%s,%s)"""
val=[(1, 1, 2, 1500),
    (2, 3, 5, 30000),
    (3, 5, 1, 3000),
    (4, 2, 3, 2500),
    (5, 4, 1, 1000)]
cursorObject.executemany(insert_into_product_details, val)
connection.commit()

In [85]:
insert_into_orders="""INSERT INTO ORDERS(ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES(%s,%s,%s,%s,%s)"""
val=[(20, 1500, '2021-10-12', 3, 5),
    (25, 30500, '2021-09-16', 5, 2),
    (26, 2000, '2021-10-05', 1, 1),
    (30, 3500, '2021-08-16', 4, 3),
    (5030, 2000, '2021-10-06', 2, 1)]
cursorObject.executemany(insert_into_orders, val)
connection.commit()

In [111]:
insert_into_rating="""INSERT INTO RATING(RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES(%s,%s,%s,%s)"""
val=[(1, 2, 2, 4),
    (2, 3, 4, 3),
    (3, 5, 1, 5),
    (4, 1, 3, 2),
    (5, 4, 5, 4)]
cursorObject.executemany(insert_into_rating, val)
connection.commit()

In [97]:
question_three = """
SELECT C.CUS_GENDER, COUNT(DISTINCT C.CUS_ID) AS NUM_CUSTOMERS
FROM CUSTOMER AS C
INNER JOIN ORDERS AS O ON C.CUS_ID = O.CUS_ID
WHERE O.ORD_AMOUNT >= 3000
GROUP BY C.CUS_GENDER;
"""
                
cursorObject.execute(question_three)
 
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['CUS_GENDER', 'NUM_CUSTOMERS'])
output_df

  CUS_GENDER  NUM_CUSTOMERS
0          F              1
1          M              1

In [99]:
question_four="""select O.*,B.PRO_NAME from Orders as O inner join
                (SELECT product.PRO_ID, product.PRO_NAME,PD.PROD_ID
                 FROM product
                 INNER JOIN product_details as PD on product.PRO_ID=PD.PRO_ID) as B
                 on O.PROD_ID=B.PROD_ID
                 WHERE O.CUS_ID=2"""
cursorObject.execute(question_four)
 
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID','PRO_NAME'])
output_df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID PRO_NAME
0    5030        2000  2021-10-06       2        1    GTA V

In [101]:
question_five="""select * from supplier as S inner join
                 (select PD.SUPP_ID from product_details as PD
                 group by PD.SUPP_ID having count(distinct PD.PRO_ID)>1)
                 as B on S.SUPP_ID=B.SUPP_ID"""
cursorObject.execute(question_five)
 
output = cursorObject.fetchall()

output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE_NO','PRO_ID'])
output_df

   SUPP_ID       SUPP_NAME SUPP_CITY SUPP_PHONE_NO  PRO_ID
0        1  Rajesh Retails     Delhi    1234567890       1

In [105]:
question_six = """
SELECT K.*, MIN_ORDER, P.PRO_ID 
FROM category AS K 
INNER JOIN (
    SELECT P.CAT_ID, Q.PRO_ID, MIN(Q.MIN_ORDER) AS MIN_ORDER
    FROM product AS P 
    INNER JOIN (
        SELECT PD.PRO_ID, MIN(O.ORD_AMOUNT) AS MIN_ORDER 
        FROM product_details AS PD 
        INNER JOIN orders AS O ON PD.PROD_ID = O.PROD_ID 
        GROUP BY PD.PRO_ID
    ) AS Q ON P.PRO_ID = Q.PRO_ID 
    GROUP BY P.CAT_ID, P.PRO_ID
) AS P ON K.CAT_ID = P.CAT_ID
"""
cursorObject.execute(question_six)
 
output = cursorObject.fetchall()
   
output_df = pd.DataFrame(output, columns=['CAT_ID','CAT_NAME','MIN_ORDER','PRO_ID'])
output_df

   CAT_ID     CAT_NAME  MIN_ORDER  PRO_ID
0       1        Books       3500       5
1       2        Games       2000       1
2       3    Groceries       1500       4
3       4  Electronics      30500       3

In [107]:
question_seven="""select P.PRO_ID,P.PRO_NAME,Q.ORD_DATE from product as P inner join
                 (select PD.PRO_ID,B.ORD_DATE FROM product_details as PD inner join
                 (select O.ORD_DATE,O.PROD_ID from orders as O where
                 O.ORD_DATE>'2021-10-05') as B
                 where PD.PROD_ID=B.PROD_ID) as Q
                 ON P.PRO_ID=Q.PRO_ID"""

cursorObject.execute(question_seven)
 
output = cursorObject.fetchall()
    
output_df = pd.DataFrame(output, columns=['PRO_ID','PRO_NAME','ORD_DATE'])
output_df

   PRO_ID PRO_NAME    ORD_DATE
0       4     OATS  2021-10-12
1       1    GTA V  2021-10-06

In [113]:
question_eight="""select C.CUS_NAME,C.CUS_ID,P.SUPP_NAME,P.SUPP_ID,P.RAT_RATSTARS FROM customer as C inner join
                 (select S.SUPP_ID,S.SUPP_NAME,Q.CUS_ID,Q.RAT_RATSTARS FROM supplier as S inner join
                 (select * from rating as R order by R.RAT_RATSTARS desc limit 3)as Q
                  on S.SUPP_ID=Q.SUPP_ID) as P
                  on C.CUS_ID=P.CUS_ID"""
cursorObject.execute(question_eight)
 
output = cursorObject.fetchall()
   
output_df = pd.DataFrame(output, columns=['CUS_ID','CUS_NAME','SUPP_NAME','SUPP_ID','RAT_RATSTARS'])
output_df

   CUS_ID  CUS_NAME       SUPP_NAME  SUPP_ID  RAT_RATSTARS
0  Pulkit         5  Rajesh Retails        1             5
1    Aman         2    Appario Ltd.        2             4
2   Megha         4     Mittal Ltd.        5             4

In [115]:
question_nine="""select CUS_NAME,CUS_GENDER FROM customer where CUS_NAME LIKE 'A%' OR CUS_NAME LIKE '%A'"""

cursorObject.execute(question_nine)
 
output = cursorObject.fetchall()
   
output_df = pd.DataFrame(output, columns=['CUS_NAME','CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   Aakash          M
1     Aman          M
2     Neha          F
3    Megha          F

In [ ]:
question_ten="""select sum(Q.ORD_AMOUNT) AS Total_Order_Amount,C.CUS_GENDER from customer as C inner join
                (select O.CUS_ID,O.ORD_AMOUNT from Orders as O)as Q
                 on C.CUS_ID=Q.CUS_ID
                 WHERE C.CUS_GENDER='M'"""
cursorObject.execute(question_ten)
 
output = cursorObject.fetchall()
   
output_df = pd.DataFrame(output, columns=['Total_Order_Amount','CUS_GENDER'])
output_df